Terraform plan for __staging__
<details>
  <summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudfoundry_service.k8s will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "k8s"  {
      ~ id                  = "************************************" -> (known after apply)
        name                = "aws-eks-service"
      ~ service_broker_name = "ssb-gsa-datagov-management-staging" -> (known after apply)
      ~ service_plans       = {
          - "raw" = "8d0b0664-8c1f-4918-9b8d-ad50ac49ecd9"
        } -> (known after apply)
      + space               = "5edc803e-3376-4788-b72c-a152f11925b0"
    }

  # cloudfoundry_service_instance.k8s_cluster will be updated in-place
  ~ resource "cloudfoundry_service_instance" "k8s_cluster" {
        id               = "ca71384e-9648-4ff4-935a-15ef811df9dd"
        name             = "ssb-k8s"
      ~ service_plan     = "8d0b0664-8c1f-4918-9b8d-ad50ac49ecd9" -> (known after apply)
        tags             = [
            "k8s",
        ]
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "54d82b92-0cb4-4fe4-bf52-287aa18d5e79"
      ~ name                             = "ssb-gsa-datagov-management-staging" -> "ssb-ssb-eks-gsa-datagov-management-staging"
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

Plan generated in [plan #16](https://github.com/GSA/datagov-ssb/actions/runs/669738708)